// Напишите программу, 
// которая на вход принимает число number и выводит, 
// является ли число чётным (делится ли оно на два без остатка).

// System.Console.WriteLine("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());

// if (number % 2 == 0)
// {
//     System.Console.WriteLine($"Число {number} является четным");
// }
// else
// {
//     System.Console.WriteLine($"Число {number} является нечетным");
// }



// using System;

// class Answer
// {
//     static void CheckIfEven(int number)
//     {
//         if (number % 2 == 0)
//         {
//             System.Console.WriteLine("четное");
//         }
//         else
//         {
//             System.Console.WriteLine("нечетное");
//         }


//     }


//     // Не удаляйте и не меняйте метод Main! 
//     static public void Main(string[] args)
//     {
//         int number;

//         if (args.Length >= 1)
//         {
//             number = int.Parse(args[0]);
//         }
//         else
//         {
//             // Здесь вы можете поменять значения для отправки кода на Выполнение
//             number = 7;
//         }

//         // Не удаляйте строки ниже
//         CheckIfEven(number);
//     }
// }

